|...+....1....+....2....+....3....+....4....+....5....+....6....+....7....+....8
00010A* PHYSICAL FILE CODING EXAMPLE
00020A                                      REF(INVENCTL/INVENTORY)
00030A                                      UNIQUE
00040A          R ORDFMT                    TEXT('Format for Purchase Orders')
00050A            ORDNBR         7  0       COLHDG('Order' 'Number')
00060A            ITMNBR    R   10
00070A            SUPNBR    R   +2          REFFLD(SUPID SUPLIB/SUPMST)
00080A            QTYORD         5B
00090A          K ORDNBR
00100A          K ITMNBR                    ABSVAL